app/Controllers/UserController.php

    public function index()
    {
        $locationModel = new CulinaryLocationModel();
        $categoryModel = new CategoryModel();

        $search = $this->request->getVar('search');
        $category = $this->request->getVar('category');
        $rating = $this->request->getVar('rating');
        $lat = $this->request->getVar('lat');
        $lng = $this->request->getVar('lng');

        // Jika tidak ada pencarian/filter, tampilkan 3 Makanan dan 3 Minuman
        if (!$search && !$category && !$rating && !$lat && !$lng) {
            $makanan = $locationModel->select('culinary_locations.*, categories.name as category_name')
                                    ->join('categories', 'categories.id = culinary_locations.category_id')
                                    ->where('culinary_locations.status', 'approved')
                                    ->where('culinary_locations.category_id', 1) // Makanan Berat
                                    ->limit(3)
                                    ->findAll();

            $minuman = $locationModel->select('culinary_locations.*, categories.name as category_name')
                                    ->join('categories', 'categories.id = culinary_locations.category_id')
                                    ->where('culinary_locations.status', 'approved')
                                    ->where('culinary_locations.category_id', 3) // Minuman Segar
                                    ->limit(3)
                                    ->findAll();

            $data = [
                'makanan'    => $makanan,
                'minuman'    => $minuman,
                'categories' => $categoryModel->findAll(),
---
SELECT `culinary_locations`.*, `categories`.`name` as `category_name`
FROM `culinary_locations`
JOIN `categories` ON `categories`.`id` = `culinary_locations`.`category_id`
WHERE `culinary_locations`.`status` = 'approved'
AND `culinary_locations`.`category_id` = 1
 LIMIT 3
SELECT `culinary_locations`.*, `categories`.`name` as `category_name`
FROM `culinary_locations`
JOIN `categories` ON `categories`.`id` = `culinary_locations`.`category_id`
WHERE `culinary_locations`.`status` = 'approved'
AND `culinary_locations`.`category_id` = 3
 LIMIT 3
SELECT *
FROM `categories`

    public function detail($id)
    {
        $locationModel = new CulinaryLocationModel();
        $reviewModel = new ReviewModel();
        $favoriteModel = new FavoriteModel();

        $location = $locationModel->select('culinary_locations.*, categories.name as category_name')
                                   ->join('categories', 'categories.id = culinary_locations.category_id')
                                   ->find($id);

        if (!$location) {
            throw \CodeIgniter\Exceptions\PageNotFoundException::forPageNotFound();
        }

        $reviews = $reviewModel->select('reviews.*, users.username')
                               ->join('users', 'users.id = reviews.user_id')
                               ->where('location_id', $id)
                               ->orderBy('created_at', 'DESC')
                               ->findAll();
---
SELECT `culinary_locations`.*, `categories`.`name` as `category_name`
FROM `culinary_locations`
JOIN `categories` ON `categories`.`id` = `culinary_locations`.`category_id`
WHERE `culinary_locations`.`id` = '1'
SELECT `reviews`.*, `users`.`username`
FROM `reviews`
JOIN `users` ON `users`.`id` = `reviews`.`user_id`
WHERE `location_id` = '1'
ORDER BY `created_at` DESC